Revit 2026 API

# DetailElementOrderUtils Class

---

A utility class that arranges the draw order of the detail elements.

SystemObject Autodesk.Revit.DBDetailElementOrderUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DetailElementOrderUtils
```
```vb
Public NotInheritable Class DetailElementOrderUtils
```
```cpp
public ref class DetailElementOrderUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DetailElementOrderUtils = class end
```

The DetailElementOrderUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreDetailElements |  |
|  | BringForward(Document, View, ElementId) | Moves the given detail instance one step closer to the front of all other detail instances in the view. |
|  | BringForward(Document, View, ICollectionElementId) |  |
|  | BringToFront(Document, View, ElementId) | Places the given detail instance in the front of all other detail instances in the view. |
|  | BringToFront(Document, View, ICollectionElementId) |  |
|  | GetDrawOrderForDetails |  |
|  | IsDetailElement | Indicates if the element is a detail element that participates in detail draw ordering in the view. |
|  | SendBackward(Document, View, ElementId) | Moves the given detail instance one step closer to the back of all other detail instances in the view. |
|  | SendBackward(Document, View, ICollectionElementId) |  |
|  | SendToBack(Document, View, ElementId) | Places the given detail instance behind all detail instances in the view. |
|  | SendToBack(Document, View, ICollectionElementId) |  |

#### Reference

Autodesk.Revit.DB Namespace